{
  "en": {
    "profile": "Profile",
    "projects": "Projects",
    "about": "About Me",
    "caseStudy": "Case Study",
    "challenges": "Challenges",
    "technicalExperiments": "Technical Experiments",
    "experiments": "Experiments",
    "certificates": "Certificates",
    "cv": "CV",
    "seeMore": "See More <br />Scroll Down",
    "aboutParagraph": "I'm Irvan, a <strong>fullstack developer</strong> with a unique journey into tech. \n    I come from a <strong>non-technical background</strong>, my early career started in the hospitality industry, \n    with my last role being a cook at <strong>the 5-star Le Meridien hotel</strong>. when the pandemic hit, the \n    hotel business was disrupted, and I had to pivot. with only a <strong>D1 diploma</strong>, I faced challenges \n    applying for jobs that required higher education. that’s when I discovered <strong>programming</strong>, \n    a field that didn’t just welcome curiosity but <strong>thrived on it</strong>.",
    "aboutParagraph2": "I taught myself <strong>programming</strong> through research and hands-on experimentation inspired by popular\n    applications. I later joined the <strong>Merdeka internship program</strong> to experience real-world industry \n    practices, completing <strong>three internships</strong> two mandatory and one bonus. I started in Batam as \n    an <strong>Android developer using Kotlin</strong>, then continued at <strong>PT TREC</strong> as a <strong>frontend developer</strong>. \n    There, I contributed to developing multiple applications using <strong>Flutter</strong> with <strong>flavor-based \n    architecture</strong>, maximizing <strong>code reuse</strong> and <strong>maintainability</strong>.",
    "aboutParagraph3": "My formal journey in tech continued when I enrolled at <strong>STMIK Jakarta STI&amp;K</strong>, where I honed my \n    academic foundation while applying what I learned directly in real-world projects. The environment \n    supported my growth not only as a student but as a <strong>developer ready to take on industry challenges</strong>.",
    "aboutParagraph4": "Now, I specialize in building <strong>scalable apps</strong> using <strong>Flutter for mobile</strong>, securing backends with \n    <strong>Node.js and MySQL</strong>, and designing <strong>modular backend architectures</strong> that separate concerns from \n    database queries to middleware. I structure code with <strong>MVVM</strong> and <strong>Atomic Design</strong>, and apply <strong>clean \n    architecture principles</strong> to improve system scalability and security.",
    "aboutParagraph5": "I’ve also explored <strong>AI</strong>, <strong>database modeling</strong>, and <strong>DevOps practices</strong> like <strong>VPS setup</strong> and <strong>reverse proxy \n    configuration</strong>. I enjoy breaking things down to understand how they work and rebuilding them better.",
    "aboutParagraph6": "For <strong>monolithic apps</strong>, I apply the <strong>MVC pattern</strong>, while for more modern, decoupled systems, I use <strong>MVVM</strong>, \n    ensuring the right structure for each case. Being a developer for me is not just about building software, \n    but about <strong>constantly evolving</strong> with it.",
    "systemArchitecture": "System Architecture",
    "mvcArchitecture": "MVC Architecture",
    "modularArchitecture": "Modular Architecture",
    "mvvmArchitecture": "MVVM Architecture",
    "challengesParagraph": "This case study is based on my undergraduate project, which took place at \n    <strong>PT TREC Digital</strong>, where I served as a frontend developer. PT TREC \n    faced challenges in managing a wide range of client requests, which led to the \n    decision to adopt <strong>Flutter</strong> due to its ability to efficiently \n    build cross-platform applications from a single codebase.",
    "challengesParagraph2": "Flutter was chosen not only for its development productivity but also because its \n    compilation process involves <strong>C++</strong>, producing <em>.dex</em> files that \n    are significantly more difficult to reverse-engineer compared to native applications \n    built with <strong>Java</strong> or <strong>Kotlin</strong>. To manage different \n    application versions for various environments, the <strong>Flutter flavor</strong> approach \n    was adopted, allowing clear separation between environments such as staging and production. \n    Furthermore, the use of Flutter flavor enabled the development of multiple applications \n    from a single codebase simply by adjusting the flavor configurations according to each \n    client's specific needs.",
    "challengesParagraph3": "As a complement to my undergraduate studies, I independently designed and developed the backend system, \n    with a strong focus on <strong>security</strong> and <strong>reliability</strong>. Several \n    techniques were implemented, including <strong>rate limiting</strong> to prevent \n    <em>DoS</em> attacks, <strong>database locking</strong> to maintain transactional consistency, \n    and the use of <strong>symmetric and asymmetric encryption</strong>, <em>digital signatures</em>, \n    and <strong>Argon2</strong> for <em>password hashing</em>. Security testing was also conducted \n    through simulated <strong>SQL injection</strong> attacks.",
    "challengesParagraph4": "With the combination of frontend and backend strategies, the system not only delivers optimal \n    performance but also ensures strong <strong>data integrity</strong> and <strong>security</strong> \n    throughout its operations.",
    "experimentsParagraph": "Throughout my learning journey, independent experimentation has been one of the most enjoyable and effective approaches for me. I often seek out references on the internet, try various techniques and technologies one by one, and draw conclusions based on the outcomes of my own trials. I understand that this method may take longer than learning directly from an expert, but through this process, I not only grasp how a system works, but also understand the reasons behind its design.",
    "experimentsParagraph2": "The case study for this undergraduate final project is based on my internship experience at <strong>PT TREC Digital</strong>, where I was assigned as a frontend developer. Although I worked in the frontend division, I independently conducted a series of experiments to enhance the quality of the system I was building. One such experiment involved implementing a <strong>LIFO (Last In First Out)</strong> stack algorithm to handle the device's back button, functioning similarly to <em>undo</em> and <em>redo</em> features. I also applied <strong>throttle</strong> and <strong>debounce</strong> techniques to ensure that API calls were triggered only once as needed, preventing excessive requests.",
    "experimentsParagraph3": "Another experiment was conducted on the home screen authorization process, where I designed a mechanism to detect when users lost internet connectivity and automatically redirect them to the login page. This approach was intended to mitigate potential attacks from malicious actors, although at this stage it remains a precautionary measure and not yet backed by concrete evidence.",
    "experimentsParagraph4": "On the backend side, I also performed independent experiments to support this undergraduate final project. These included implementing authentication and authorization systems, creating a <strong>rate limiter</strong> to defend against <em>Denial of Service (DoS)</em> attacks, and using <strong>database locking</strong> to maintain data consistency during transfer operations. To deepen my understanding, I intentionally exposed a local test environment to <em>SQL injection</em> vulnerabilities in order to observe how such attacks interact with MySQL.",
    "experimentsParagraph5": "Another set of experiments involved server management using a <strong>Virtual Private Server (VPS)</strong>. I explored how to set up a <strong>reverse proxy</strong> with <strong>Nginx</strong> and installed <strong>SSL/TLS</strong> certificates to secure a custom domain I personally purchased. Furthermore, I implemented a <strong>rate limiter</strong> directly on the Nginx layer to add an extra security layer before requests reached the backend system.",
    "experimentsParagraph6": "All of these experiments were carried out with the aim of expanding my understanding of how to build systems that are not only functional, but also secure and reliable under real-world conditions.",
    "downloadCertificate": "Download Certificate",
    "footer": "&copy; 2025 Irvan Al Rasyid. Made with passion.",
    "demoApp": "Demo banking android application:",
    "usernamePassword1": "username: <strong>jhonDoe</strong><br /> password: <strong>jhonDoe123!</strong>",
    "usernamePassword2": "username: <strong>irvan</strong><br /> password: <strong>irvan123!</strong>",
    "confirmDownload": "Are you sure you want to download",
    "username": "username",
    "password": "password",
    "confirmDownloadYes": "Yes",
    "confirmDownloadNo": "No"
  },
  "id": {
    "profile": "Profil",
    "projects": "Proyek",
    "about": "Tentang Saya",
    "caseStudy": "Studi Kasus",
    "challenges": "Tantangan",
    "technicalExperiments": "Eksperimen Teknis",
    "experiments": "Eksperimen",
    "certificates": "Sertifikat",
    "cv": "CV",
    "seeMore": "Lihat Selengkapnya <br />Gulir ke Bawah",
    "aboutParagraph": "Saya Irvan, seorang <strong>fullstack developer</strong> dengan perjalanan unik menuju dunia teknologi. \n    Saya berasal dari <strong>latar belakang non-teknis</strong>, dan karier awal saya dimulai di industri perhotelan. \n    Posisi terakhir saya adalah sebagai koki di <strong>hotel bintang 5 Le Meridien</strong>. Ketika pandemi melanda, \n    bisnis hotel terguncang dan saya harus beradaptasi. Dengan hanya bermodal <strong>ijazah D1</strong>, saya kesulitan \n    melamar pekerjaan yang mensyaratkan pendidikan tinggi. Saat itulah saya menemukan <strong>pemrograman</strong>, \n    bidang yang bukan hanya menerima rasa ingin tahu, tetapi <strong>tumbuh dari hal itu</strong>.",
    "aboutParagraph2": "Saya belajar <strong>pemrograman</strong> secara otodidak melalui riset dan eksperimen langsung dengan meniru aplikasi populer.\n    Kemudian saya bergabung dengan <strong>program magang Merdeka</strong> untuk merasakan praktik industri nyata, dan berhasil menyelesaikan \n    <strong>tiga kali magang</strong> dua wajib dan satu tambahan. Saya memulai dari Batam sebagai <strong>Android developer dengan Kotlin</strong>, \n    lalu lanjut di <strong>PT TREC</strong> sebagai <strong>frontend developer</strong>. Di sana saya berkontribusi mengembangkan beberapa aplikasi \n    menggunakan <strong>Flutter</strong> dengan pendekatan <strong>arsitektur flavor-based</strong>, yang memaksimalkan <strong>penggunaan ulang kode</strong> \n    dan <strong>kemudahan pemeliharaan</strong>.",
    "aboutParagraph3": "Perjalanan formal saya di bidang teknologi dimulai saat saya mendaftar di <strong>STMIK Jakarta STI&amp;K</strong>, \n    di mana saya memperkuat dasar akademis sambil langsung menerapkan ilmu tersebut ke dalam proyek nyata. \n    Lingkungan kampus mendukung perkembangan saya, bukan hanya sebagai mahasiswa tetapi juga sebagai \n    <strong>developer yang siap menghadapi tantangan industri</strong>.",
    "aboutParagraph4": "Saat ini, saya fokus mengembangkan <strong>aplikasi yang skalabel</strong> menggunakan <strong>Flutter untuk mobile</strong>, \n    mengamankan backend dengan <strong>Node.js dan MySQL</strong>, serta merancang <strong>arsitektur backend modular</strong> \n    yang memisahkan tanggung jawab mulai dari query database hingga middleware. Saya menyusun kode dengan pendekatan \n    <strong>MVVM</strong> dan <strong>Atomic Design</strong>, serta menerapkan <strong>prinsip clean architecture</strong> untuk \n    meningkatkan skalabilitas dan keamanan sistem.",
    "aboutParagraph5": "Saya juga telah mengeksplorasi <strong>Kecerdasan Buatan (AI)</strong>, <strong>pemodelan basis data</strong>, dan praktik <strong>DevOps</strong> \n    seperti <strong>pengaturan VPS</strong> dan <strong>konfigurasi reverse proxy</strong>. Saya senang membongkar sesuatu untuk memahami cara kerjanya, \n    lalu membangunnya kembali dengan lebih baik.",
    "aboutParagraph6": "Untuk <strong>aplikasi monolitik</strong>, saya menggunakan pola <strong>MVC</strong>, sementara untuk sistem modern yang lebih terpisah, \n    saya menerapkan <strong>MVVM</strong> agar setiap kasus memiliki struktur yang tepat. Bagi saya, menjadi developer bukan hanya soal \n    membangun perangkat lunak, tapi juga tentang <strong>terus berkembang</strong> bersamanya.",
    "systemArchitecture": "Arsitektur Sistem",
    "mvcArchitecture": "Arsitektur MVC",
    "modularArchitecture": "Arsitektur Modular",
    "mvvmArchitecture": "Arsitektur MVVM",
    "challengesParagraph": "Studi kasus ini didasarkan pada proyek tugas akhir saya, yang dilakukan di \n    <strong>PT TREC Digital</strong> di mana saya berperan sebagai frontend developer. \n    PT TREC menghadapi tantangan dalam menangani berbagai permintaan klien, \n    sehingga diputuskan untuk menggunakan <strong>Flutter</strong> karena kemampuannya \n    membangun aplikasi lintas platform secara efisien dari satu basis kode.",
    "challengesParagraph2": "Flutter dipilih bukan hanya karena produktivitas pengembangannya, tetapi juga karena \n    proses kompilasinya menggunakan <strong>C++</strong> dan menghasilkan file <em>.dex</em> \n    yang jauh lebih sulit untuk direverse-engineer dibandingkan aplikasi native yang dibangun \n    dengan <strong>Java</strong> atau <strong>Kotlin</strong>. Untuk mengelola berbagai versi \n    aplikasi sesuai dengan lingkungan yang berbeda, pendekatan <strong>Flutter flavor</strong> \n    diadopsi, memungkinkan pemisahan yang jelas antara staging dan production. \n    Selain itu, penggunaan Flutter flavor juga memungkinkan pengembangan beberapa aplikasi \n    dari satu basis kode dengan hanya menyesuaikan konfigurasi flavor sesuai kebutuhan spesifik \n    masing-masing klien.",
    "challengesParagraph3": "Sebagai pelengkap dari studi sarjana saya, saya secara mandiri merancang dan mengembangkan sistem backend, \n    dengan fokus kuat pada aspek <strong>keamanan</strong> dan <strong>keandalan</strong>. Beberapa teknik diterapkan, \n    termasuk <strong>rate limiting</strong> untuk mencegah serangan <em>DoS</em>, <strong>penguncian basis data</strong> \n    untuk menjaga konsistensi transaksi, serta penggunaan <strong>enkripsi simetris dan asimetris</strong>, \n    <em>tanda tangan digital</em>, dan <strong>Argon2</strong> untuk <em>hashing kata sandi</em>. \n    Pengujian keamanan juga dilakukan melalui simulasi serangan <strong>SQL injection</strong>.",
    "challengesParagraph4": "Dengan kombinasi strategi frontend dan backend, sistem ini tidak hanya memberikan kinerja yang optimal, \n    tetapi juga memastikan <strong>integritas data</strong> dan <strong>keamanan</strong> yang kuat dalam seluruh operasionalnya.",
    "experimentsParagraph": "Sepanjang perjalanan belajar saya, eksperimen mandiri telah menjadi salah satu pendekatan yang paling menyenangkan dan efektif. Saya sering mencari referensi di internet, mencoba berbagai teknik dan teknologi satu per satu, lalu menarik kesimpulan berdasarkan hasil dari percobaan saya sendiri. Saya menyadari bahwa metode ini mungkin memakan waktu lebih lama dibandingkan belajar langsung dari seorang ahli, namun melalui proses ini, saya tidak hanya memahami cara kerja suatu sistem, tetapi juga alasan di balik desainnya.",
    "experimentsParagraph2": "Studi kasus untuk tugas akhir ini didasarkan pada pengalaman magang saya di <strong>PT TREC Digital</strong>, di mana saya ditugaskan sebagai frontend developer. Meskipun saya berada di divisi frontend, saya secara mandiri melakukan serangkaian eksperimen untuk meningkatkan kualitas sistem yang saya bangun. Salah satu eksperimen tersebut adalah penerapan algoritma stack <strong>LIFO (Last In First Out)</strong> untuk menangani tombol kembali pada perangkat, berfungsi mirip seperti fitur <em>undo</em> dan <em>redo</em>. Saya juga menerapkan teknik <strong>throttle</strong> dan <strong>debounce</strong> untuk memastikan bahwa pemanggilan API hanya terjadi sekali sesuai kebutuhan, sehingga mencegah permintaan berlebihan.",
    "experimentsParagraph3": "Eksperimen lainnya dilakukan pada proses otorisasi halaman beranda, di mana saya merancang mekanisme untuk mendeteksi saat pengguna kehilangan koneksi internet dan secara otomatis mengarahkan mereka ke halaman login. Pendekatan ini dimaksudkan untuk mengurangi potensi serangan dari aktor jahat, meskipun pada tahap ini masih bersifat langkah pencegahan dan belum didukung oleh bukti konkret.",
    "experimentsParagraph4": "Di sisi backend, saya juga melakukan eksperimen mandiri untuk mendukung proyek akhir sarjana ini. Eksperimen tersebut mencakup penerapan sistem otentikasi dan otorisasi, pembuatan <strong>rate limiter</strong> untuk mencegah serangan <em>Denial of Service (DoS)</em>, dan penggunaan <strong>database locking</strong> untuk menjaga konsistensi data selama proses transfer. Untuk memperdalam pemahaman saya, saya secara sengaja membuka celah <em>SQL injection</em> pada lingkungan uji lokal guna mengamati bagaimana serangan tersebut berinteraksi dengan MySQL.",
    "experimentsParagraph5": "Serangkaian eksperimen lainnya berfokus pada manajemen server menggunakan <strong>Virtual Private Server (VPS)</strong>. Saya mengeksplorasi cara mengatur <strong>reverse proxy</strong> menggunakan <strong>Nginx</strong> dan menginstal sertifikat <strong>SSL/TLS</strong> untuk mengamankan domain kustom yang saya beli secara pribadi. Selain itu, saya juga menerapkan <strong>rate limiter</strong> langsung pada lapisan Nginx guna menambahkan lapisan keamanan ekstra sebelum permintaan mencapai sistem backend.",
    "experimentsParagraph6": "Seluruh eksperimen ini dilakukan dengan tujuan untuk memperluas pemahaman saya tentang bagaimana membangun sistem yang tidak hanya fungsional, tetapi juga aman dan andal dalam kondisi dunia nyata.",
    "downloadCertificate": "Unduh Sertifikat",
    "footer": "&copy; 2025 Irvan Al Rasyid. Dibuat dengan sepenuh hati.",
    "demoApp": "Demo aplikasi android perbankan:",
    "usernamePassword1": "nama pengguna: <strong>jhonDoe</strong><br /> kata sandi: <strong>jhonDoe123!</strong>",
    "usernamePassword2": "nama pengguna: <strong>irvan</strong><br /> kata sandi: <strong>irvan123!</strong>",
    "confirmDownload": "Apakah Anda yakin ingin mengunduh",
    "username": "nama pengguna",
    "password": "kata sandi",
    "confirmDownloadYes": "Ya",
    "confirmDownloadNo": "Tidak"
  }
}
